billing_cf/InformationRegisters/энргУслугиТочекУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргУслугиТочекУчета</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Техническая</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьАбонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

billing_cf/InformationRegisters/энргУслугиТочекУчета/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет услуги действующих точек.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыОтбора		-	Структура.
//  ТаблицаДляПомещения	-	Строка.
//
Процедура УслугиДействующихТочек(Схема,ПараметрыОтбора,ТаблицаДляПомещения = "") Экспорт 
	
	Если Схема = Неопределено Тогда
		РегистрыСведений.энргАктивностьТочекУчета.АктивныеТочкиУчетаПомещения(Схема,ПараметрыОтбора,"ДействующиеТочки");
	Иначе
		ЕстьДействующиеТочки 			= Ложь;
		Для Каждого яПакет Из Схема.ПакетЗапросов Цикл
			Если яПакет.ТаблицаДляПомещения  = "ДействующиеТочки" Тогда
				ЕстьДействующиеТочки 	= Истина;
				Прервать;
			КонецЕсли;		
		КонецЦикла;
		
		Если НЕ ЕстьДействующиеТочки Тогда
			РегистрыСведений.энргАктивностьТочекУчета.АктивныеТочкиУчетаПомещения(Схема,ПараметрыОтбора,"ДействующиеТочки");
		КонецЕсли;
	КонецЕсли; 	
	
	Пакет 							= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаУслугиДействующихТочек());
	Пакет.ТаблицаДляПомещения 		= ТаблицаДляПомещения;
	Пакет.ВыбиратьРазрешенные 		= ?(ПараметрыОтбора.Свойство("ВыбиратьРазрешенные") и НЕ ПараметрыОтбора.ВыбиратьРазрешенные, ЛОЖЬ, ИСТИНА);
	ОператорВыбора 					= Пакет.Операторы[0];	
	Источник 						= ОператорВыбора.Источники[0].Источник;
	Параметры 						= Источник.Параметры;
	
	ПараметрПериод 					= Параметры[0];
	
	Если НЕ ПараметрыОтбора.Свойство("Период") Тогда
		ПараметрПериод.Выражение 	= Новый ВыражениеСхемыЗапроса("");
	ИначеЕсли НЕ ПараметрыОтбора["Период"].ИмяПараметра = "Период" Тогда
		ПараметрПериод.Выражение 	= Новый ВыражениеСхемыЗапроса(СтрЗаменить(ПараметрПериод.Выражение,"&Период","&" + ПараметрыОтбора["Период"].ИмяПараметра));		
	КонецЕсли;
	
	Если ПараметрыОтбора.Свойство("ПараметрыВТ") Тогда
		ДоступныеПараметры 					= "Организация, Район, КлючПомещения, ТочкаУчета";
		энргФормированиеТекстовЗапроса.УстановитьПараметрыВременнойТаблицыРегистраСведений(ОператорВыбора.Источники[0].Источник.Параметры[1],ПараметрыОтбора.ПараметрыВТ,ДоступныеПараметры);		
	КонецЕсли;
	
	ВспомогательныеПоля 			= "Период,Регистратор,НомерСтроки,Активность,ПериодРегистрации,ПериодНачисления";
	
	Если ПараметрыОтбора.Свойство("ВыбиратьВсеПоля") И ПараметрыОтбора.ВыбиратьВсеПоля Тогда
		мВспомогательныеПоля 		= СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ВспомогательныеПоля,",",Истина);
		Для Сч  = 0 По мВспомогательныеПоля.ВГраница() Цикл
			Выражение 				= Источник.Псевдоним + "." + мВспомогательныеПоля[Сч] + " КАК " + мВспомогательныеПоля[Сч];
			ОператорВыбора.ВыбираемыеПоля.Добавить(Выражение);
		КонецЦикла;		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ГИСЖКХ

// Заполняет схему срез последних моменты времени.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыОтбора		-	Структура.
//  ТаблицаДляПомещения	-	Строка.
//
Процедура ЗаполнитьСхемуСрезПоследнихМоментыВремени(Схема, ПараметрыОтбора, ТаблицаДляПомещения = "") Экспорт
	
	Если Схема = Неопределено Тогда
		Схема 								= Новый СхемаЗапроса;
		Пакет 								= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 								= Схема.ПакетЗапросов.Добавить();
	КонецЕсли;
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаСрезПоследнихМоментыВремени());
	Пакет.ТаблицаДляПомещения 				= ТаблицаДляПомещения;
	
	ОператорыВыбора 						= Пакет.Операторы[0].Источники[0].Источник.Запрос.Операторы[0].Источники[0].Источник.Запрос.Операторы;
	ОсновнойОператор 						= ОператорыВыбора[0];
	ЕстьВременнаяТаблица					= Ложь;
	ПоляВременных 							= Новый Соответствие;
	ДоступныеПоляОтбора 					= "Организация,Район,КлючПомещения,ТочкаУчета";	 
	ИменаВременныхТаблиц 					= Новый Массив;
	ДоступныеПоляСоединений 				= СтрРазделить("Организация,Район,КлючПомещения,ТочкаУчета",",");
	
	Если ПараметрыОтбора.Свойство("ПараметрыВТ") Тогда
		ПараметрыВТ 						= ПараметрыОтбора.ПараметрыВТ;
		Для Индекс = 0 По ПараметрыВТ.ВГРаница() Цикл
			ОписаниеПараметра 				= ПараметрыВТ[Индекс];
			Если ОписаниеПараметра.ТипПараметра = "ТипПараметраВременнаяТаблица" Тогда
				Для Каждого КлючЗначение Из ОписаниеПараметра.СоотвествиеПолей Цикл
					Если ДоступныеПоляСоединений.Найти(КлючЗначение.Ключ) = Неопределено Тогда
						Продолжить;
					КонецЕсли; 
					ЕстьВременнаяТаблица 	= Истина;
					ИндексВременной 		= ИменаВременныхТаблиц.Найти(ОписаниеПараметра.ТаблицаИсточник);
					Если ИндексВременной = Неопределено Тогда
						ИменаВременныхТаблиц.Добавить(ОписаниеПараметра.ТаблицаИсточник);
						ПоляВременных.Вставить(ОписаниеПараметра.ТаблицаИсточник, Новый Массив);									 
					КонецЕсли;
					ПоляВременных[ОписаниеПараметра.ТаблицаИсточник].Добавить(КлючЗначение);
				КонецЦикла;				
			ИначеЕсли ОписаниеПараметра.ТипПараметра = "ТипПараметраРавно" Тогда
				врПараметры 				= Новый Массив;
				врПараметры.Добавить(ОписаниеПараметра);
				энргФормированиеТекстовЗапроса.УстановитьОтборТаблицы(ОсновнойОператор.Отбор, "УслугиТочекУчета", врПараметры, ДоступныеПоляОтбора);
			КонецЕсли;
		КонецЦикла;		
	КонецЕсли;
	
	Если ЕстьВременнаяТаблица Тогда 		
		Для Индекс = 0 По ИменаВременныхТаблиц.ВГраница() Цикл
			НовыйИсточник 					= ОсновнойОператор.Источники.Добавить(ИменаВременныхТаблиц[Индекс]);			
			УсловиеСоединения 				= Новый Массив;
			СоотвествиеПолей 				= ПоляВременных[ИменаВременныхТаблиц[Индекс]];
			Для Каждого КлючЗначение Из СоотвествиеПолей Цикл
				Если ДоступныеПоляСоединений.Найти(КлючЗначение.Ключ) = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				УсловиеСоединения.Добавить(СтрШаблон("УслугиТочекУчета.%1 = %2.%3", КлючЗначение.Ключ, ИменаВременныхТаблиц[Индекс], КлючЗначение.Значение));
			КонецЦикла;
			УсловиеСоединения.Добавить(СтрШаблон(
			"ВЫБОР 
			|	КОГДА УслугиТочекУчета.Период < %1.Период
			|		ТОГДА ИСТИНА
			|	КОГДА УслугиТочекУчета.Период = %1.Период
			|		ТОГДА УслугиТочекУчета.Регистратор < %1.Регистратор
			|	ИНАЧЕ ЛОЖЬ
			|КОНЕЦ", ИменаВременныхТаблиц[Индекс]));
			ОсновнойОператор.Источники[0].Соединения.Добавить(ИменаВременныхТаблиц[Индекс],СтрСоединить(УсловиеСоединения,Символы.ПС + " И ")); 
			НовоеСоединение 				= ОсновнойОператор.Источники[0].Соединения[ОсновнойОператор.Источники[0].Соединения.Количество() -1];
			НовоеСоединение.ТипСоединения 	= ТипСоединенияСхемыЗапроса.Внутреннее;			
		КонецЦикла;	
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаУслугиДействующихТочек()
	
	Текст =
	"ВЫБРАТЬ
	|	энргУслугиТочекУчетаСрезПоследних.Организация КАК Организация,
	|	энргУслугиТочекУчетаСрезПоследних.Район КАК Район,
	|	энргУслугиТочекУчетаСрезПоследних.КлючПомещения КАК КлючПомещения,
	|	энргУслугиТочекУчетаСрезПоследних.ТочкаУчета КАК ТочкаУчета,
	|	энргУслугиТочекУчетаСрезПоследних.Услуга КАК Услуга,
	|	энргУслугиТочекУчетаСрезПоследних.Техническая КАК Техническая
	|ПОМЕСТИТЬ УслугиТочекУчета
	|ИЗ
	|	РегистрСведений.энргУслугиТочекУчета.СрезПоследних(
	|			&Период,
	|			(Организация, Район, КлючПомещения, ТочкаУчета) В
	|				(ВЫБРАТЬ
	|					ДействующиеТочки.Организация,
	|					ДействующиеТочки.Район,
	|					ДействующиеТочки.КлючПомещения,
	|					ДействующиеТочки.ТочкаУчета
	|				ИЗ
	|					ДействующиеТочки КАК ДействующиеТочки)) КАК энргУслугиТочекУчетаСрезПоследних";
	
	Возврат Текст;
	
КонецФункции

Функция ТекстЗапросаСрезПоследнихМоментыВремени()
	
	Текст  =
	"ВЫБРАТЬ
	|	УслугиТочекУчета.Организация КАК Организация,
	|	УслугиТочекУчета.Район КАК Район,
	|	УслугиТочекУчета.КлючПомещения КАК КлючПомещения,
	|	УслугиТочекУчета.ТочкаУчета КАК ТочкаУчета,
	|	УслугиТочекУчета.Услуга КАК Услуга
	|ИЗ
	|	(ВЫБРАТЬ
	|		УслугиТочекУчета.Организация КАК Организация,
	|		УслугиТочекУчета.Район КАК Район,
	|		УслугиТочекУчета.КлючПомещения КАК КлючПомещения,
	|		УслугиТочекУчета.ТочкаУчета КАК ТочкаУчета,
	|		УслугиТочекУчета.Период КАК Период,
	|		МАКСИМУМ(УслугиТочекУчета.Регистратор) КАК Регистратор
	|	ИЗ
	|		(ВЫБРАТЬ
	|			УслугиТочекУчета.Организация КАК Организация,
	|			УслугиТочекУчета.Район КАК Район,
	|			УслугиТочекУчета.КлючПомещения КАК КлючПомещения,
	|			УслугиТочекУчета.ТочкаУчета КАК ТочкаУчета,
	|			МАКСИМУМ(УслугиТочекУчета.Период) КАК Период
	|		ИЗ
	|			РегистрСведений.энргУслугиТочекУчета КАК УслугиТочекУчета
	|		
	|		СГРУППИРОВАТЬ ПО
	|			УслугиТочекУчета.Организация,
	|			УслугиТочекУчета.Район,
	|			УслугиТочекУчета.КлючПомещения,
	|			УслугиТочекУчета.ТочкаУчета) КАК ВложенныйЗапрос
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргУслугиТочекУчета КАК УслугиТочекУчета
	|			ПО ВложенныйЗапрос.Организация = УслугиТочекУчета.Организация
	|				И ВложенныйЗапрос.Район = УслугиТочекУчета.Район
	|				И ВложенныйЗапрос.КлючПомещения = УслугиТочекУчета.КлючПомещения
	|				И ВложенныйЗапрос.ТочкаУчета = УслугиТочекУчета.ТочкаУчета
	|				И ВложенныйЗапрос.Период = УслугиТочекУчета.Период
	|	
	|	СГРУППИРОВАТЬ ПО
	|		УслугиТочекУчета.Организация,
	|		УслугиТочекУчета.Район,
	|		УслугиТочекУчета.КлючПомещения,
	|		УслугиТочекУчета.ТочкаУчета,
	|		УслугиТочекУчета.Период) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргУслугиТочекУчета КАК УслугиТочекУчета
	|		ПО ВложенныйЗапрос.Организация = УслугиТочекУчета.Организация
	|			И ВложенныйЗапрос.Район = УслугиТочекУчета.Район
	|			И ВложенныйЗапрос.КлючПомещения = УслугиТочекУчета.КлючПомещения
	|			И ВложенныйЗапрос.ТочкаУчета = УслугиТочекУчета.ТочкаУчета
	|			И ВложенныйЗапрос.Период = УслугиТочекУчета.Период
	|			И ВложенныйЗапрос.Регистратор = УслугиТочекУчета.Регистратор";
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти

#КонецЕсли
